[
  {
    "model": "online_store.categoryproduct",
    "pk": 1,
    "fields": {
      "title": "Apple",
      "description": "Продукция компании Apple",
      "parent_category": null
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 2,
    "fields": {
      "title": "iPhone",
      "description": "Смартфоны компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 3,
    "fields": {
      "title": "MacBook",
      "description": "Ноутбуки компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 4,
    "fields": {
      "title": "iMac",
      "description": "Моноблок компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 5,
    "fields": {
      "title": "Mac mini",
      "description": "Компактный настольный компьютер компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 6,
    "fields": {
      "title": "Mac Studio",
      "description": "Компактный настольный компьютер компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 7,
    "fields": {
      "title": "Apple Watch",
      "description": "Умные часы компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.categoryproduct",
    "pk": 8,
    "fields": {
      "title": "iPad",
      "description": "Планшет компании Apple",
      "parent_category": 1
    }
  },
  {
    "model": "online_store.product",
    "pk": 1,
    "fields": {
      "title": "Apple iPad Pro (2022) 11\"",
      "description": "Обновлённые iPad Pro, представленные осенью 2022 года стал мощнее за счёт процессора Apple M2 и получил целый ряд полезных нововведений: поддержку новой функции Apple Pencil Hover, новые функции камер (так, например, основная камера с сенсором LiDAR теперь может записывать видео в Pro Res), более современные стандарты беспроводной связи и всё это в сочетании с новыми функциями iPad OS 16.\r\nДаже модели iPad Pro на M1 до сих пор остаются впечатляюще мощными для своего класса, но производительности никогда не бывает много, поэтому обновлённая версия 2022 года получила процессор M2, обеспечивающий 15-процентный прирост производительности, но самое главное – более мощную 10-ядерную графику. Аппаратное ускорение обработки H.264, HEVC, ProRes и ProRes RAW – приятный бонус для всех, кто рассматривает планшет для монтажа видео.\r\nЯркий полностью ламинированный Retina-дисплей iPad Pro с частотой обновления до 120 Гц поддерживает Apple Pencil 2, а нововведением в модельном ряду 2022 года стала функция Hover: просто наведите стилус на объект на расстоянии до 1,2 см, не касаясь экрана, чтобы увидеть точку касания или выполнить определённое действие. Apple Pencil Hover открывает больше возможностей для работы в профессиональных приложениях и делает использование стилуса ещё удобнее.\r\nКачественные квадрофонические динамики обеспечивают потрясающий звук, поэтому внешняя акустика или наушники совсем не необходимость при работе за iPad Pro, во время игры или при просмотре видео на планшете. Массив из пяти качественных микрофонов обеспечивает отличный звук без посторонних шумов, что будет очень полезным во время разговоров или записи видео.",
      "image": "default.png",
      "category": 8,
      "price": 116990,
      "date_creation": "2023-11-19T11:39:23.286Z",
      "last_modified_date": "2023-11-19T11:39:23.286Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 2,
    "fields": {
      "title": "Apple Watch Ultra 2 GPS + Cellular, 49 мм",
      "description": "Самые функциональные и защищённые часы получили обновление и стали ещё лучше. Apple Watch Ultra 2 не боятся глубины, пыли и ударов, и при этом они идеальны и в повседневной жизни, позволяя вам оставаться в курсе событий, общаться и даже заменять собой телефон, когда это необходимо. Большое количество приложений расширяет их функциональность до невиданных ранее пределов, а невероятный экран обеспечит максимально комфортное использование.\r\nКорпус часов сделан из титана, поэтому Apple Watch Ultra 2 не только прочные и лёгкие, но и отлично сочетаются с iPhone 15 Pro и Pro Max. Дизайн серии Ultra выделяется среди других моделей Apple Watch. Корпус часов защищен от пыли и ударов и соответствует военному стандарту MIL-STD 810H, а сапфировое стекло устойчиво к царапинам, при этом оно плоское, поэтому установка дополнительной защиты не вызовет сложностей.\r\nДисплей Apple Watch Ultra 2 не только больше, чем у любых других моделей, включая Series 9, но и ярче – до 3000 нит, что выгодно выделяет обновлённую модель от Watch Ultra первого поколения. Такой экран отлично видно на улице, а его размер делает работу с приложениями и чтение уведомлений более комфортным. Функция Always-On display позволяет всегда видеть информацию без необходимости взаимодействия с гаджетом.\r\nApple Watch Ultra 2 идеальны для дайвинга. Титановый корпус модели легко переносит солёную воду и не подвержен коррозии. Часы выдерживают погружения на глубину до 100 метров и надежно работают на глубине до 40 метров. Для управления гаджетом под водой можно пользоваться колёсиком Digital Crown. Доступное в в AppStore стороннее приложение Oceanic+ позволяет превратить часы в настоящий подводный дайвинг-компьютер. Кроме того, Apple Watch Ultra 2 часы сертифицированы по стандарту EN13319.",
      "image": "default.png",
      "category": 7,
      "price": 119990,
      "date_creation": "2023-11-19T12:25:42.423Z",
      "last_modified_date": "2023-11-19T12:25:42.423Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 3,
    "fields": {
      "title": "Apple MacBook Pro 16 MK183 Space Gray (M1 Pro 10-Core, GPU 16-Core, 16GB, 512GB)",
      "description": "Обновление линейки MacBook Pro осенью 2021 года стало настоящим праздником для всех, кто ждал мощные ноутбуки на Apple Silicon. Невероятная производительность, потрясающие экраны, оптимальный набор портов и возвращение магнитной зарядки MagSafe при сохранении возможности заряжать ноутбук через USB-C, а также масса менее значимых, но не менее приятных улучшений сделали линейку MacBook Pro мечтой каждого пользователя Mac.\r\nЭкран Liquid Retina XDR сделан по тем же технологиям, что и профессиональный монитор Apple. Он способнен отображать миллиард цветов, отличается невероятной контрастностью, а пиковая яркость составляет 1600 нит (постоянная – 1000 нит), что является недостижимой планкой для других ноутбуков. За счёт тонких рамок экраны стали чуть больше, чем у предыдущих моделей MacBook Pro того же размера, а динамическая частота обновления с пределом в 120 Гц гарантирует невероятную плавность.\r\nПроцессоры M1 Pro обеспечивают очень высокий уровень производительности, на фоне которого даже выпущенный осенью 2020 года M1 уже не кажется фантастическим. Техпроцесс 5 нм позволил разместить более 33 миллиардов транзисторов, а встроенная графика M1 Pro легко может соперничать с дискретными видеокартами. Скорость обмена данными с оперативной памятью составляет внушительные 200 ГБ/с, а в составе SoС имеются высокоэффективные и энергоэффективные ядра, а также 16 ядер для машинного обучения.\r\nПроизводительность встроенной графики M1 Pro сопоставима с мощными дискретными видеокартами. Аппаратная оптимизация ProRes существенно ускоряет кодирование видео в данном формате. Кроме того, к ноутбукам с процессором M1 Pro можно подключать два внешних монитора с разрешением 6К – более чем достаточно для комфортной работы в любых приложениях.",
      "image": "default.png",
      "category": 3,
      "price": 179990,
      "date_creation": "2023-11-19T12:31:19.417Z",
      "last_modified_date": "2023-11-19T12:31:19.417Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 4,
    "fields": {
      "title": "Apple iPhone 15 Pro Max 256GB, Natural Titanium",
      "description": "Новый корпус, новые возможности камеры, более мощный процессор и разъём USB-C – это лишь основные нововведения iPhone 15 Pro Max. Самый большой и технически совершенный айфон 15-й серии станет идеальным гаджетом для любых задач и отличным инструментом для покорения соцсетей и видеохостингов. Всех, кто пропустил 14-е поколение, ждут дополнительные приятные изменения в виде таких фишек как Always-On, динамический остров и 48-Мегапиксельная основная камера, а улучшенная автономность позволит реже думать о зарядке.\r\nПоследние поколения iPhone с приставкой \"Pro\" были довольно тяжёлыми. Уменьшить вес iPhone 15 Pro Max в Apple решили с помощью нового материала – титана. Рамка устройства сделана из такого же титана, который используется для изготовления деталей космических аппаратов, а уникальная текстура этого металла придаёт устройству премиальный вид, при этом вес удалось уменьшить, несмотря на более ёмкий аккумулятор, а слегка закруглённые края порадуют всех, кому было неудобно держать смартфон без чехла.\r\nДисплей iPhone 15 Pro Max радует не только впечатляющей яркостью и глубокими цветами, но и динамической частотой обновления, которая может достигать 120 Гц. Динамический остров выводит взаимодействие с уведомлениями и фоновыми приложениями на новый уровень, а диагональ в 6,7 дюйма при впечатляющей плотности пикселей позволит с комфортом смотреть видео, обрабатывать снимки прямо с экрана смартфона и играть не только в привычные игры, но и в новые ААА-тайтлы, пришедшие на iPhone прямо с консолей.\r\nОсновная камера смартфона получила тот же сенсор, что и в iPhone 14 Pro Max, но теперь съёмка в разрешении 48 Мпикс. доступна не только в формате ProRAW. Переработанные алгоритмы позволяют получать 24-Мегапиксельные снимки с максимальной детализацией при высокой светочувствительности за счёт того, что смартфон снимает сразу в двух режимах биннинга (12 и 48 Мп), а затем создаёт усреднённое изображение автоматически с использованием технологий машинного обучения.\r\nВсе три задние камеры iPhone 15 Pro Max получили особое антибликовое покрытие, поэтому \"зайчики\" и засветки остаются в прошлом. Улучшилась и система стабилизации, появилась возможность съёмки в LOG, а видео в формате ProRes теперь можно снимать и с частотой 60 к/с, а подключив внешний диск через разъём USB-C, можно записывать видео сразу на него, минуя встроенную памяти, при этом готовые материалы будет легче скопировать на любой компьютер для монтажа (или работать прямо с внешним носителем). Ещё одной интересной особенностью камер стал автоматический портретный режим, а размытие фона можно включить на любом готовом снимке.\r\nПроцессор A17 Pro, изготовленный по техпроцессу 3 нм стал ещё производительнее. Так, например, максимальное количество операций в секунду увеличилось вдвое, в сравнении с A16 Bionic, и составляет умопомрачительные 35 триллионов. Изменения коснулись и графики: теперь аппаратная трассировка лучей может похвастаться достаточным уровнем производительности, чтобы превратить смартфон в портативную консоль, а обработка фото и задачи, связанные с машинным обучением, ожидаемо стали ещё лучше.",
      "image": "default.png",
      "category": 2,
      "price": 157990,
      "date_creation": "2023-11-19T12:58:18.841Z",
      "last_modified_date": "2023-11-19T12:58:59.786Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 5,
    "fields": {
      "title": "Apple Mac Studio MQH63 (M2 Ultra 24-Core, GPU 60-Core, 64 GB, 1 Tb)",
      "description": "Mac Studio – это невероятная мощь в компактном корпусе. В Apple долго пытались создать очень мощный настольный компьютер, который не придётся ставить под стол или покупать к нему колёсики – стоит вспомнить Mac Pro 2013 года или iMac Pro, представленный в 2017. Собственные процессоры позволили добиться долгожданного чуда, а в сочетании с монитором Studio Display, Mac Studio – это знакомый и любимый 27-дюймовый iMac, но гораздо мощнее и с возможностью апгрейда вычислительной части путём замены системного блока. Обновлённый модельный ряд 2023 года способен обеспечить ещё больше производительности, при этом внешне компьютер не изменился.\r\nДизайн Mac Studio с процессорами M2 Max и M2 Ultra не изменился, по сравнению с моделями первого поколения. Он сочетает в себе черты нескольких поколений Mac mini, а концепция компактного, но очень мощного системного блока, который легко поместится на столе, многим напомнит легендарный PowerMac G4 Cube. Корпус компьютера сделан из анодированного алюминия, а приятным отличием от Mac mini стало наличие портов как сзади, так и спереди.\r\nВозможности Mac Studio по-настоящему огромны. Он легко справится с любыми профессиональными приложениями, отлично подойдёт для монтажа, особенно при использовании Final Cut Pro X c видео в формате ProRes, за счёт аппаратного ускорения и поддерживает все современные функции macOS. При желании его можно брать с собой, ведь к Mac Studio можно подключить любой монитор, причём не один, а сразу восемь (или шесть в разрешении 6K). Кроме того, компьютер оснащён современными модулями беспроводной связи и поддерживает Touch ID при использовании фирменной клавиатуры со сканером отпечатка (приобретается отдельно).\r\nКак создать невероятно мощную платформу для тяжёлых задач? Всё просто, соединить два очень мощных SoC. M2 Ultra – это два M2 Max, поэтому Mac Studio c M2 Ultra имеет невероятное количество ядер ЦП, два невероятно мощных графических процессора, 32 ядра Neural Engine и отличается умопомрачительной скоростью обмена данными с памятью, составляюей 800 ГБ/с. Кроме того, платформа может воспроизводить до 22 потоков видео 8K в ProRes.",
      "image": "default.png",
      "category": 6,
      "price": 499990,
      "date_creation": "2023-11-19T13:00:43.957Z",
      "last_modified_date": "2023-11-19T13:00:43.957Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 6,
    "fields": {
      "title": "Apple Mac mini MNH73 (M2 Pro 10‑core GPU 16-core, 16GB, 512GB)",
      "description": "Mac mini 2023 года – это отличная возможность попробовать Mac с минимальными вложениями, получив высокопроизводительный компьютер, к которому можно подключить уже имеющиеся монитор, клавиатуру, мышь и другие аксессуары, при этом он занимает минимум места. Более того, при желании, Mac mini даже можно использовать как продвинутую ТВ-приставку. Высокая производительность, которую обеспечивает мощный процессор от Apple, делает такого \"малыша\" отличным компьютером не только для повседневных простых задач, но и для работы в профессиональных ресурсоёмких приложениях.\r\nМощный 8-ядерный процессор M2, как и предшествующий ему M1, сделан по 5-нанометровому техпроцессу, но множество оптимизаций позволило значительно увеличить производительность без значительного увеличения нагрева и энергопотребления. В среднем производительность M2 на 20% выше, чем у M1, а встроенная графика мощнее на 35%, а в ряде сценариев, например при конвертировании ProRes видео, M2 демонстрирует многократный прирост даже в сравнении с M1. Отдельные ядра Neural Engine отвечают за задачи, связанные с машинным обучением, а специальный модуль аппаратного шифрования ускоряет работу File Vault. Встроенная графика позволяет подключать дисплеи с высоким разрешением: до 6K по Thunderbolt и до 4K по HDMI, при этом можно одновременной подключить сразу два монитора: 6K + 5K/4K (в зависимости от используемого разъёма).\r\nПорты Thunderbolt / USB 4 обеспечивают море возможностей и полную свободу использования всевозможных устройств и аксессуаров. Вы можете подключать быстрые внешние SSD и дисковые массивы, большие мониторы и телевизоры, а также более специализированные гаджеты. Максимальная скорость передачи данных составляет внушительные 40 Гбит/с, а всевозможные хабы и многопортовые адаптеры от сторонних производителей позволят дополнить и без того богатый набор проводных интерфейсов Mac mini, среди которых порты USB-A и USB-C, HDMI, Ethernet и аудиоразъём с поддержкой высокоимпедансных наушников.",
      "image": "default.png",
      "category": 5,
      "price": 175990,
      "date_creation": "2023-11-19T13:57:17.881Z",
      "last_modified_date": "2023-11-19T13:57:17.881Z"
    }
  },
  {
    "model": "online_store.product",
    "pk": 7,
    "fields": {
      "title": "Apple iMac 4.5K 24\" (2021) Green (M1 8-Core CPU/8-Core GPU, 16GB, 2Tb)",
      "description": "История дизайна устройств Apple довольно интересна, особенно своей цикличностью. Самый известный пример – все iPhone 12-й серии, очень напоминающие iPhone 5, 5S и SE. В далёком 1998 году были представлены iMac G3, поразившие всех своим дизайном и разнообразием расцветок. В 2021 году Apple показали обновление линейки iMac на собственных процессорах. Теперь моноблок удивляет не только многообразием расцветок, но и невероятно тонким корпусом и приятные сюрпризы на этом только начинаются. 24-дюймовый дисплей iMac можно назвать «золотой серединой», если сравнить первую линейку на M1 с предыдущими моделями. Моноблок легко поместится на любом столе, а размеры экрана оптимальны для большинства задач. Параметры встроенного дисплея Retina тоже впечатляют: разрешение 4,5K, миллиард цветов, высокая яркость и отличная цветопередача. Стекло с минимальным отражением света практически исключает блики. При необходимости, к компьютеру можно подключить дополнительный монитор с разрешением до 6К. В 2021 году, на момент выхода iMac 24”, возможности процессора M1 уже не вызывают сомнений. Компьютеры на базе чипа от Apple побили множество рекордов производительности. Улучшенная оптимизация под фирменные пакеты (например, Final Cut), возможность запуска ПО для iOS и множество приятных особенностей, таких как моментальный выход из режима сна, сделали первый настольный процессор Apple мечтой многих пользователей Mac. Встроенная многоядерная графика позволяет наслаждаться современными играми, а для запуска старых приложений предусмотрен специальный автоматический эмулятор, поэтому проблемы с совместимостью практически исключены. Наработки Apple по улучшению динамиков в компактных устройствах добрались до iMac. Моноблоки компании всегда отличались громким и насыщенным звуком, но модель 2021 года – это новый шаг. Система из шести динамиков обеспечивает объёмный детализированный звук, заполняющий окружающее пространство. Поддержка технологии Dolby Atmos позволит с в полной мере насладиться кино и сериалами, не подключая наушники или внешнюю акустику. Встроенная веб-камера iMac заметно отличается от аналогов во всех компьютерах Apple, выпущенных ранее. Она отличается не только более высоким разрешением, но и технологией шумоподавления, которая делает изображение приятным, вне зависимости от окружающего освещения. Ваши собеседники будут видеть вас практически как вживую.",
      "image": "default.png",
      "category": 4,
      "price": 300990,
      "date_creation": "2023-11-19T16:55:30.200Z",
      "last_modified_date": "2023-11-19T16:55:30.200Z"
    }
  },
  {
    "model": "online_store.contacts",
    "pk": 1,
    "fields": {
      "country": "USA",
      "inn": "91-1144442",
      "address": "Redmond,WA,98052-6399",
      "support_email": "dmitriytsindrin@mail.ru"
    }
  }
]